IdeaRS.OpenModel.Detail.ReinfBarInclined
Representing reinforcement inclined bar in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.ReinfBarInclined.#ctor
Constructor

IdeaRS.OpenModel.Detail.ReinfBarInclined.MasterComponent
Master component of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarInclined.MasterPoint
Master point of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarInclined.MasterEdge
Master edge of reinforcement - edge from which is measured angle

IdeaRS.OpenModel.Detail.ReinfBarInclined.InclinedReinfBarType
Type of inclined reinf bar

IdeaRS.OpenModel.Detail.ReinfBarInclined.Angle
Angle between bar and master edge

IdeaRS.OpenModel.Detail.ReinfBarInclined.AddBarOnTop
Add bar on top - possible only for FullLength

IdeaRS.OpenModel.Detail.ReinfBarInclined.TopLength
Length of additional bar on the top

IdeaRS.OpenModel.Detail.ReinfBarInclined.AddBarOnBottom
Add bar on Bottom - possible only for FullLength

IdeaRS.OpenModel.Detail.ReinfBarInclined.BottomLength
Length of additional bar on the bottom